In [3]:
import pandas as pd

In [5]:
file1 = "Resources/sampleData.csv"

In [7]:
file_read = pd.read_csv(file1)

In [8]:
file_read.head()

   id first_name   last_name       Phone Number      Time zone
0   1      Peter  Richardson    7-(789)867-9023  Europe/Moscow
1   2     Janice       Berry   86-(614)973-1727    Asia/Harbin
2   3     Andrea      Hudson   86-(918)527-6371  Asia/Shanghai
3   4     Arthur    Mcdonald  420-(553)779-7783  Europe/Prague
4   5      Kathy     Morales  351-(720)541-2124  Europe/Lisbon

In [9]:
file_read.describe()

               id
count  100.000000
mean    50.500000
std     29.011492
min      1.000000
25%     25.750000
50%     50.500000
75%     75.250000
max    100.000000

In [14]:
names = file_read.loc[:,['first_name','last_name']]
names.tail()

   first_name  last_name
95     Arthur  Henderson
96  Christina      Riley
97   Nicholas      Green
98      Debra     Peters
99    Matthew     Murray

In [17]:
phone_number = file_read.iloc[0:3,0:2]
phone_number

   id first_name
0   1      Peter
1   2     Janice
2   3     Andrea

In [18]:
set_index_name = file_read.set_index('first_name')
set_index_name.head()

            id   last_name       Phone Number      Time zone
first_name
Peter        1  Richardson    7-(789)867-9023  Europe/Moscow
Janice       2       Berry   86-(614)973-1727    Asia/Harbin
Andrea       3      Hudson   86-(918)527-6371  Asia/Shanghai
Arthur       4    Mcdonald  420-(553)779-7783  Europe/Prague
Kathy        5     Morales  351-(720)541-2124  Europe/Lisbon

In [21]:
file_read.iloc[3,2]

'Mcdonald'

In [24]:
file_read.iloc[0:3]

   id first_name   last_name      Phone Number      Time zone
0   1      Peter  Richardson   7-(789)867-9023  Europe/Moscow
1   2     Janice       Berry  86-(614)973-1727    Asia/Harbin
2   3     Andrea      Hudson  86-(918)527-6371  Asia/Shanghai

In [26]:
file_read.iloc[[1,2],[3,2]]

       Phone Number last_name
1  86-(614)973-1727     Berry
2  86-(918)527-6371    Hudson

In [27]:
only_Berry = file_read.loc[file_read['last_name']=='Berry']
only_Berry

   id first_name last_name      Phone Number    Time zone
1   2     Janice     Berry  86-(614)973-1727  Asia/Harbin